[{"name": "OMI Industries (OMI)", "address": "Illinois", "details": {"Business Type": "Manufacturer", "Industry Type": "Air and Climate", "Market Focus": "Globally (various continents)"}, "panels": [{"title": "About Us", "description": "Controlling industrial odors comes naturally – and safely.OMI Industries specializes in developing natural solutions to control industrial odors. Our innovative Ecosorb technology eliminates industrial odors without the use of harsh or hazardous chemicals, expensive emission control systems or masking fragrances. It’s safer for you and the environment.Instead, Ecosorb odor neutralizer has been engineered to seek out and destroy organic and inorganic odors on a molecular level – safely and effectively neutralizing even the most persistent industrial odor. No matter how offensive the smell, OMI will engineer an environmentally-friendly solution for eliminating the odor at its source. Several options for delivery systems are available depending on your application.\nEarth-Friendly, Effective Solutions for Industrial Odor Management.OMI Industries is a leading developer of safe and effective industrial odor management solutions for a wide variety of applications. Our proprietary Ecosorb odor eliminator doesn’t mask smells, it neutralizes them by breaking down and removing a broad spectrum of organic and inorganic odors.From landfills to refineries to wastewater treatment facilities, OMI offers an industrial odor management solution that’s safe for you, your process and the environment. Ecosorb odor eliminator is biodegradable and can be applied through a number of delivery systems, including atomization, vaporization, encapsulation or infusion into end products - making it the natural odor management solution for virtually any situation.Meet our leadership team.Our development team is constantly researching new odor solution and exploring new product solutions and improvements to existing formulas. Each of our products withstands rigorous testing for quality control and assurance. We’re even working on new delivery systems to meet the odor control needs of new and evolving industrial environments.Don’t mask industrial odor, get rid of it with Ecosorb odor neutralizing solutions. Contact OMI to today to learn more about controlling industrial odors."}, {"title": "Products", "description": "Ecosorb destroys odors. Period.For virtually every odor, every industry, every plant, factory or facility, there is Ecosorb® odor solutions. OMI Industries offers a full line of products designed to neutralize industrial odors and eliminate noxious emissions. For every type of environment, Ecosorb® is available as water-based, gel or additive formulas.See how Ecosorb eliminates odors.Delivery systems.Ecosorb is available in a variety of formulas, each custom designed by OMI Industries to neutralize industrial odors. These formulas include:\n\nEquipment specialists.In addition to providing the right Ecosorb® formulation for your specific industry, OMI will also outfit you with the right equipment to optimize the application. Our equipment is designed specifically for battling the worst industrial odors. After you have selected the appropriate delivery system, we will help you choose the right equipment for the job. Choose a complete selection of:"}, {"title": "Markets Served", "description": "Ecosorb odor systems are used successfully worldwide in a number of industries.Ecosorb odor systems serve a wide variety of industries around the world. Click on a link below to learn more about the major industrial markets where our systems are currently in place to effectively control odor:\nFor every application, our odor control systems and products offer the following benefits:\nIf you do not see your industry listed, contact OMI for more information on how Ecosorb odor systems and neutralizers can help you eliminate your most challenging industrial odors."}]}, {"name": "The Reclamation Group (Pty) Ltd.", "address": "South Africa", "details": {"Business Type": "Technology", "Industry Type": "Metal", "Market Focus": "Internationally (various countries)", "Year Founded": "1998", "Employees": "Over 1000", "Turnover": "$100,000,000 US - $1,000,000,000 US"}, "panels": [{"title": "About Us", "description": "Our mission and vision encompasses:\nOur core value of integrity ensures that our operations are carried out in an environmentally responsible manner, in accordance with international standards to maximise positive  environmental impact."}, {"title": "Milestones / History", "description": "The Reclamation Group (Pty) Ltd (“Reclam”) traces its origins to a metal recycling business co-founded by David Kassel in 1970.Prior to 1998, activities of the founders of Reclam included:\nIn late 1998, Reclam was established to form a market leader that would have the size and scope to create economies of scale and operating efficiencies in the South African recycled metal processing industry.Between 1998 and 2000, Reclam acquired a number of businesses involved in the production of recycled ferrous and non-ferrous metal products. It consolidated 14 such businesses situated in South Africa and in Mozambique.By 2000, Reclam achieved a leading position in the recycled ferrous and non-ferrous metals markets, expanding its operations by diversifying into other products that could benefit from similar economies of scale and operating efficiencies. This included:\nIn 2000, Reclam identified growth opportunities in Southern Africa and established operations in Botswana, Kenya, Malawi, Mozambique, Swaziland, Zambia and Zimbabwe.In 2003, Reclam concluded its first Black Economic Empowerment (“BEE”) transaction pursuant to which 25% plus one share of the equity was sold to Phamangu Investment Holdings in a transaction partly funded by the Industrial Development Corporation of South Africa.During 2005, the Company expanded its business into semi-finished products as part of the strategy to add value to its wide range of recycled products it produces. These included aluminium ingots in partnership with Murray & Roberts Limited, and copper sulphate, integral to the refining of platinum.Effective 1 February 2006, in terms of a management buyout, The New Reclamation Group (Proprietary) Limited (“Reclam Group”) was formed to acquire the business and all of the assets of Reclam. In order to facilitate this buyout, Reclam Group issued a high-yield bond, which is listed on the Irish Stock Exchange, to a broad range of prominent European investors.Subsequent to the buyout, Reclam Group concluded a further empowerment transaction in 2008. Reclam Group’s empowerment partners are part of a consortium which holds a 25% stake in Scaw Metals,a division of Anglo Operation Limited.Today, Reclam’s business can be considered as “above-the-ground” mining. Reclam beneficiates basic commodities that are sold to the same customer base as that of the mines. The only difference is that its raw material is a secondary or recycled material relative to “virgin” material which is beneficiated from an ore."}]}, {"name": "Jenoptik AG", "address": "Germany", "details": {"Business Type": "Manufacturer", "Industry Type": "Manufacturing, Other", "Market Focus": "Globally (various continents)", "Employees": "Over 1000"}, "panels": [{"title": "About us", "description": "Jenoptik is a globally operating technology group, which is active in the three photonics-based divisions Light & Optics, Light & Production and Light & Safety as well as with VINCORION for mechatronics solutions.\nAs the holding company and corporate center of the group, JENOPTIK AG, based in Jena, performs top-level functions for strategic corporate management as well as the central functions IT, human resources, purchasing, security, work and health protection, environmental protection and real estate management."}, {"title": "Optical Systems", "description": "With its Optical Systems division Jenoptik is one of the few development and production partners worldwide for optical and micro-optical systems and precision components designed to meet the highest quality standards.\nThe division offers solutions made of optical glass, fused silica and crystals, infrared materials as well as plastic that can be coated for wavelengths from far IR up to DUV. Jenoptik also possesses outstanding expertise in the development and manufacture of micro-optics for beam shaping used in the semiconductor industry and laser material processing.\nThe product portfolio also includes solutions for information and communication technologies as well as for defense and security."}, {"title": "Healthcare & Industry", "description": "In the Healthcare & Industry division Jenoptik develops specific system and application solutions with customers worldwide in the healthcare sector and industry. The focus is on medical technology and life science, laser, automotive and LED lighting applications.\nThe product portfolio includes semiconductor chips, optoelectronics, laser technology, polymer optics, electronics and software. Based on its core competences from laser and LED based beam sources, optical components and modules to sensors, digital imaging and system integration, Jenoptik is a leader in the development of OEM system solutions and products for the life science industry. These are, amongst others, highly reliable analysis and treatment systems for research, clinical applications, and patient self-diagnosis, which comply with international quality standards and strict approval criteria. Examples are next-generation DNA analysis, LASIK, and blood glucose measurements.\nFor industrial applications, Jenoptik offers high-performance optoelectronic components and modules as well as integrated solutions which if required intelligently combine optics, laser technology, sensors and digital imaging. In addition to development of complex components for head-up displays, innovative lenses for driver assistance systems and polymer optics for machine vision or augmented reality applications, the division also produces powerful, energy-efficient industrial LED lighting. In the area of industrial lasers for laser material processing, Jenoptik is active in the entire laser value creation chain."}, {"title": "Automotive", "description": "With its Automotive division Jenoptik is one of the leading manufacturers of metrology and laser processing systems for manufacturing processes in the automotive industry. The Metrology portfolio includes high-precision contact and non-contact production metrology for a wide range of measurement tasks such as the pneumatic, tactile or optical testing of roughness, contour and form, as well as determining dimensions throughout all phases of the production process and in the metrology lab. The Metrology product range is rounded off with a comprehensive service offering advice, training and customer service, as well as long-term maintenance agreements.\nIn the area of Laser Processing, Jenoptik develops 3D laser systems and machines that are integrated into production lines for our customers as part of their process optimization and automation. These systems are used for processing plastics, metals and leather with maximum efficiency, precision and safety. The portfolio is complemented by energy-efficient and environmentally friendly exhaust cleaning systems for residue-free removal of pollutants during laser material processing and other industrial processes."}, {"title": "Traffic Solutions", "description": "The Traffic Solutions division develops, manufactures and distributes components, systems and services which contribute towards greater road traffic safety throughout the world. Based on the proven Robot Technology, the market-leading product portfolio comprises comprehensive systems relating to all aspects of road traffic, such as speed measurement and red light monitoring systems, OEM (Original Equipment Manufacturer) products and systems for the detection of traffic violations.\nExpertise extends to measuring average speed over a defined section of road (section speed control) and automated number plate recognition (ANPR). In the service field we cover every aspect of the traffic safety process chain – from system development, production and installation of the monitoring infrastructure to image capture and automated processing."}, {"title": "Defense & Civil Systems", "description": "The Defense & Civil Systems division develops, produces and distributes mechatronic and sensor systems for civil and military applications. The portfolio ranges from individual assemblies, which customers then integrate into their systems, through to complete systems and end products.\nThe division’s areas of competence are energy systems, optical sensor systems, stabilization systems, aviation systems as well as radomes & composites. Top-quality customer service ensures that the Jenoptik products and customer systems are supported over their useful lives, which generally extend over many years.\nThe mechatronic products include diesel-electric gensets, electrical machines such as alternators, electric motors or converters, power electronics, heating systems and control units as well as lift systems and rescue hoists. They are used in drive, stabilization and energy systems for military and civil vehicle, rail and aircraft equipment.\nThe sensor systems include infrared camera systems and laser rangefinders and are primarily used in automation technology as well as in security technology and military reconnaissance."}]}, {"name": "GEMÜ Gebrüder Müller Apparatebau GmbH & Co. KG", "address": "Germany", "details": {"Business Type": "Manufacturer", "Industry Type": "Water and Wastewater", "Market Focus": "Globally (various continents)", "Year Founded": "1964", "Employees": "Over 1000"}, "panels": [{"title": "About Us", "description": "Leading the world in Pharmaceutical and Biotechnology Industry sterilization processesGEMÜ is one of the leading manufacturers of valves, measurement and control systems, and is the world market leader of valves for sterile applications in the pharmaceutical and biotechnology industries. This position was achieved following GEMÜ's comprehensive investments in application-specific research & development, amounting to more than 5% of the company's turnover.An engineering tradition that secures first place in innovationsThe level of innovation is closely linked to location - Germany is regarded globally as a nation of engineers. GEMÜ is over halfway up the chart of the top 1,000 German global market leaders for 2011. The GEMÜ headquarters is in the region that is home to the highest density of global market leaders, the region of Heilbronn-Franken in Baden-Württemberg. GEMÜ's international success is based essentially on the enterprise and pioneering spirit of Fritz Müller, who developed the world's first plastic process valve in 1964. This directly controlled solenoid valve was the starting point for the foundation of GEMÜ that year.Systematic development towards successful productsTime and time again, Fritz Müller was quick in recognizing important new developments. He was one of the first to concentrate on sectors that now set the pace for the world economy. The leading position in the Pharmaceutical and Biotechnology Industries results from Fritz Müller's instincts and his insight into practical process applications. He is still a vital driving force for new products and services to this day. Within GEMÜ a system for succession is also in place, to ensure that the next generation can further develop the success of this family-owned enterprise."}]}, {"name": "Solmate Communications", "address": "Nigeria", "details": {"Business Type": "Distributor", "Industry Type": "Waste Management", "Market Focus": "Regionally (various states or provinces)", "Year Founded": "2015"}, "panels": []}, {"name": "SEA srl", "address": "Italy", "details": {"Business Type": "Manufacturer", "Industry Type": "Recycling Systems", "Market Focus": "Internationally (various countries)", "Year Founded": "1970"}, "panels": [{"title": "About us", "description": "1989:the developed technologies allowed SEA to approach even the recycling industryand, consequently, to realise sorting machines specifically conceived for plastic materials andglassrecovery and sorting.  In 2004 the new resonance sorting machine enriches the SEA product range, gaining increasing amounts of approval in the extensive markets.   The latest machine ranges with state-of-the-art technology let SEA have a constantly growing trend in the last years. SEA technology has actually found its application into several fields, from food industry, to seeds, recycling and mineral ones, representing a fundamental benchmark for a growing number of operators into several Countries.\nThis is also why,in May 2013, SEA moved its headquarters into a new industrial area of 4500 mq dedicated to production area, laboratories, testing room, offices and management."}]}, {"name": "Heger GmbH & Co.KG", "address": "Germany", "details": {"Business Type": "Manufacturer", "Industry Type": "Recycling Systems", "Market Focus": "Globally (various continents)"}, "panels": [{"title": "About Us", "description": "The modular range of products includes machines for coarse and fine crushing with primary crushers and fine grinders, screening and dust extraction systems, mixing and dosing systems, draining systems and compression systems for a wide range of materials from ARCEL to XPS."}, {"title": "More about Heger GmbH & Co.KG", "description": ""}]}, {"name": "Albis Plastic Gmbh", "address": "Germany", "details": {"Business Type": "Software vendor", "Industry Type": "Plastics & Resins", "Market Focus": "Globally (various continents)"}, "panels": [{"title": "About us", "description": "We are a global company, with eight manufacturing locations worldwide, as well as a total of 26 subsidiaries in many countries throughout Europe, North Africa, Asia and North America. Our values and philosophy, however, remain those of a traditional, medium- size, Hanseatic company. This combination enables us to be innovative and progressive."}, {"title": "Our Prin­ci­ple", "description": "Our customers appreciate our reliability and our comprehensive technical expertise, which covers every aspect of plastics manufacturing and processing. Our keen eye for market developments is another crucial advantage.\nOur customers come first for us, which is why we are constantly expanding our portfolio. In addition to high-quality plastics by global manufacturing leaders, we also offer our own, specially developed compounds – tailor-made to fit the needs of a single component, a specific company, or an entire industry.\nOur goal is to provide a complete supply of top-quality polymers, and we always work closely with our customers to identify ideal solutions. Our exceptional regional and international sales teams are the foundation of our entire business. Our aim is to grow and expand together with our customers."}]}, {"name": "Aquila Recycling Industries", "address": "Uganda", "details": {"Business Type": "Service provider", "Industry Type": "Material Recycling", "Market Focus": "Internationally (various countries)"}, "panels": []}, {"name": "Innovative Recycling (Pty) Ltd.", "address": "South Africa", "details": {"Business Type": "Service provider", "Industry Type": "Waste and Recycling", "Market Focus": "Internationally (various countries)"}, "panels": []}, {"name": "BASF Catalysts", "address": "NJ", "details": {"Business Type": "Manufacturer", "Industry Type": "Air Pollution Treatment", "Market Focus": "Globally (various continents)"}, "panels": [{"title": "About Us", "description": "BASF is the world's leading chemical company: The Chemical Company. Its portfolio ranges from chemicals, plastics and performance products to agricultural products, fine chemicals and oil and gas.\nAs a reliable partner BASF helps its customers in virtually all industries to be more successful. With its high-value products and intelligent solutions, BASF plays an important role in finding answers to global challenges such as climate protection, energy efficiency, nutrition and mobility."}]}, {"name": "Exhibition Management Services", "address": "South Africa", "details": {"Business Type": "Event organizer", "Industry Type": "Plastics & Resins", "Market Focus": "Internationally (various countries)"}, "panels": []}, {"name": "Eagle Weighing Systems Ltd", "address": "Uganda", "details": {"Business Type": "Distributor", "Industry Type": "Laboratory Equipment", "Market Focus": "Internationally (various countries)", "Year Founded": "2006", "Employees": "11-100", "Turnover": "$10,000,000 US - $100,000,000 US"}, "panels": [{"title": "Digital Truck Weighing Scale/Truck Scale/Industrial Floor Scale at Eagle Weighing Scales kampala, Ug", "description": "“ We don't just sell scales, we solve problems”\nIncepted in the year 2006, we Eagle Weighing Systems Ltd are recognized as one of the foremost , Suppliers, Traders and Wholesalers of impeccable rangeofweighing scales such as; Whole sale scales, Baby scales, Mini palm scales, Industrial platforms, assorted weighing brands including Avery, Salter, Health ( height and weight ) scales, Precision scales Analytical/Laboratory scales, Moisture meters, Temperature gauges, Pallet trolleys, kitchen scales, Animal scales, Bag closers-stitching machine, Plastic bag sealers, Plastic foot sealers, Batch sealers, Table top scales, Counter scales, Barcode readers/printer, Waterproof scales, Axle weigh bridge, Mini and full Weigh bridges among others. These products are developed by skillful professionals utilizing quality approved material which we have sourced from certified vendors of the market. Under these categories we offer Table Top Scales – Digital, Price Computing Scales Digital, Pocket Precision Scales, Personal Weighing Scales Digital, Beam Scales Mechanical, Counter Scales Mechanical, Liquid Measures, Pedestal – Mechanical, Regular Platform Scale Load Cell and Crane Weighing Scales Digital. Our offered range is designed in adherence set with industry norms & standards with the help of cutting-edge technology. Excellent quality control has been established by us to make sure that our assortment is free from fault .\nWe are located at Wandegeya\nFor more details please contact us on ; +256 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com\neagleweighingsystems.blogspot.com\nhttps://plus.google.com/u/0/104815763787026905059\nhttps://twitter.com/EagleWeighing\nhttps://facebook.com/eagle.weighingsystems\nhttps://eagleweighingsystems.wordpress.com/contact/\nhttps://www.linkedin.com/in/eagle-weighingsystems\nhttps://www.instagram.com/eagleweighingsystems/\nhttps://eagleweighingsystems.blogspot.com/\nhttps://www.google.com/maps/place/Eagle+Weighing+Systems/\nhttps://eagle-weighing-systems-ltd.business.site/\nhttps://eagle-weighing-scales-kampalauganda.business.site\n\n\n\n"}, {"title": "Digital weight 3 ton electric warehouse weighing scales", "description": "We provide innovative solutions and professional services ranging from simple weight scale applications and preventative maintenance contracts to complex automation and engineering design.\nWe have over 10 years of combined experience in industrial weighing, specializing in electronic and mechanical weighing systems. We offer sales and service of all major national brands.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "A12E platform weighing scales in Kampala", "description": "We have access to all different types of digital scales. Eagle Weighing Scales can supply a digital scale to fit any weighing application, including custom applications of any kind. We also will match any competitors price for any digital scale we carry.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Heavy duty weighing scales in Kampala", "description": "Eagle Weighing Scales Company presents and delivers state of the art scales as well as traditional scales at the most affordable prices. We understand your needs as a customer and client. We also understand your budget. We do our level best to exceed your expectations in quality, service, design and function. After all It is The Eagle Weighing Scales (Way). These are just some of the many types of scales we carry: digital scales, mini palm sized scales, pocket scales, bathroom scales, weighing scales, weigh scale, specialty scales, balance scales, diet scales, shipping scales, Tanita scales, ohaus scales, counting scales, baby scales, gram scales, portable scales, body fat scales, crane scales, electronic scales, travel scales, floor scales, kitchen scales, wholesale scales, and triple beam scales. Most any type of digital scale you can think of, Eagle Weighing Scales carries.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "weight floor weighing scales for industries", "description": "Eagle Weighing Scales can help you find the scale that fits your needs and your budget. If you are tired of the high prices found at other sites for the same product and are looking for an affordable solution. Then you have come to the right place! If you shop around you will see skyrocketing prices from competitors and chances are they get their scales directly from us. It only makes sense to come to the Source. Eagle Weighing Scales is your source for quality, design, function, and friendly timely service with a knowledgeable staff. We are committed to doing business the dignified ethical way and in a way you deserve. The Eagle Weighing Scales. Thank you in advance for allowing Eagle Weighing Scales the privilege of serving you.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Electronic Digital Industrial Platforms Kampala", "description": "Eagle Weighing Scales Company, Uganda is headquartered in Wandegeya, Kampala, and is a world leader in the sale and supply of precision measurement and product inspection equipment for the health care, laboratory, and other industrial markets.  The Eagle Weighing Scales Medical,  Weighing, and Inspection business units are all renowned for developing reliable, market-proven solutions for the customers they serve.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Weighing Scale Bench Scale For Sale in Kampala", "description": "Eagle Weighing Scales Company is a multi-national measurement and control equipment supplier with national headquarters in Kampala, plus operations and distribution centers in Jinja, Entebbe, Mukono, Lira, Gulu, Masaka, Wakiso, Soroti and Mbale\nEagle Weighing Scales company firmly believes in providing our customers with innovative superior quality products that are competitively priced. Our qualified sales staff will help you     determine the weighing systems best suited for your growing needs.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Electronic Weighing Scales", "description": "At Eagle Weighing Scales company we provide:Hydraulic, Electronic and Mechanical Truck and Rail Car ScalesHopper, Tank, Bin, Floor, Bench , Lab, Counting, Health and Custom ScalesLoad Cells, Mounts and HardwareInstrumentation and Process ControlsLeasing / Rentals Available\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Electronic Price computing platform scales", "description": "Since 2006, Eagle Weighing Scales company has served the needs for our customers from the pearl of Africa.  With our main office in Wandegeya, we are the largest scale company in the Kampala Uganda and East Africa. Opening a new location in\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "300kg Digital Platform weighing scale", "description": "We are proud to offer the widest array of scale equipment available to the weighing industry. Manufacturers such as; Avery, Rice Lake Weighing Systems, Mettler toledo, High Weigh, Seca, Ohaus and Adam Equipment. Sales, service, installation – we do all our own construction to save time and money!\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "1000 kg digital weight scales and machines", "description": "We pride our company registered business on providing superior customer service. We recognize the importance of reliability in your business. That is the very reason our service department is on call 24 hours a day. Our factory-trained technicians can troubleshoot system failures by utilizing the latest technological equipment. Thus, saving your business from costly down time\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "platform floor scale industrial weighing scales", "description": "Eagle Weighing Scales company would like you to know we guarantee complete customer satisfaction. Simply stated, this means we will always do whatever it takes to fully satisfy every customer, every time.We do not offer vehicle weighing scales services.  You have to get a certified weight ticket from a public scale.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "platform floor scale industrial weighing scales", "description": "Eagle Weighing Scales company would like you to know we guarantee complete customer satisfaction. Simply stated, this means we will always do whatever it takes to fully satisfy every customer, every time.We do not offer vehicle weighing scales services.  You have to get a certified weight ticket from a public scale.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "electronic platform digital weighing scale with railing", "description": "Eagle Weighing Scales company is a private-owned, URSB and UNBS certified corporation, and has been Supplying and distributing weight-related products and supplies since 2006. Within the company, progressive new technologies merge with the wisdom of industry experience to create the future of weighing through cutting-edge research and design.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Digital Platform scale 40kg electronic weigh scale", "description": "Eagle Weighing Scales’ roots are planted firmly in the principles of quality and customer service. Through three generations of family ownership, these ideals remain unchanged. Today, Eagle Weighing Scales is a global leader in measurement and automated process control.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Electronic floor weighing scale bench scales", "description": "Eagle Weighing Scales offers more than 40,000 products, with over one million items in stock and available for same- or next-day shipping. The company continues to lead the industry in technological advances and quality products, all with legendary customer service."}, {"title": "Eagle scales 300 Kg platforms in Kampala", "description": "Eagle Weighing Scales provides weighing solutions for process and packaging in a variety of industries including food processing, automated manufacturing, chemical, plastics, rubber, and more. We have been offering accurate, quality industrial weighing scales since 2006 and recently celebrated our Centennial year! Eagle Weighing Scales assists processors and manufacturers by offering solutions that create a drastic reduction in waste while enhancing quality and productivity by as much as 50% over other industrial weighing and packaging equipment.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Eagle scales 300 Kg platforms in Kampala", "description": "Eagle Weighing Scales provides weighing solutions for process and packaging in a variety of industries including food processing, automated manufacturing, chemical, plastics, rubber, and more. We have been offering accurate, quality industrial weighing scales since 2006 and recently celebrated our Centennial year! Eagle Weighing Scales assists processors and manufacturers by offering solutions that create a drastic reduction in waste while enhancing quality and productivity by as much as 50% over other industrial weighing and packaging equipment.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Eagle scales 300 Kg platforms in Kampala", "description": "Eagle Weighing Scales provides weighing solutions for process and packaging in a variety of industries including food processing, automated manufacturing, chemical, plastics, rubber, and more. We have been offering accurate, quality industrial weighing scales since 2006 and recently celebrated our Centennial year! Eagle Weighing Scales assists processors and manufacturers by offering solutions that create a drastic reduction in waste while enhancing quality and productivity by as much as 50% over other industrial weighing and packaging equipment.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}]}, {"name": "Weighing Scales Company In Uganda", "address": "Uganda", "details": {"Business Type": "Manufacturer", "Industry Type": "Agriculture", "Market Focus": "Globally (various continents)", "Year Founded": "2008", "Employees": "101-1000", "Turnover": "$10,000,000 US - $100,000,000 US"}, "panels": [{"title": "What is the price of a weighing scale in Kampala ?", "description": "Eagle Weighing Scales provides weighing solutions for process and packaging in a variety of industries including food processing, automated manufacturing, chemical, plastics, rubber, and more. We have been offering accurate, quality industrial weighing scales since 2006 and recently celebrated our Centennial year! Eagle Weighing Scales assists processors and manufacturers by offering solutions that create a drastic reduction in waste while enhancing quality and productivity by as much as 50% over other industrial weighing and packaging equipment.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Do you need a weighing scale ?", "description": "We provide innovative solutions and professional services ranging from simple weight scale applications and preventative maintenance contracts to complex automation and engineering design.\nWe have over 10 years of combined experience in industrial weighing, specializing in electronic and mechanical weighing systems. We offer sales and service of all major national brands.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Weighing scales shop in Uganda", "description": "We have access to all different types of digital scales. Eagle Weighing Scales can supply a digital scale to fit any weighing application, including custom applications of any kind. We also will match any competitors price for any digital scale we carry.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Where to buy digital weighing scales in Kampala", "description": "Eagle Weighing Scales Company presents and delivers state of the art scales as well as traditional scales at the most affordable prices. We understand your needs as a customer and client. We also understand your budget. We do our level best to exceed your expectations in quality, service, design and function. After all It is The Eagle Weighing Scales (Way). These are just some of the many types of scales we carry: digital scales, mini palm sized scales, pocket scales, bathroom scales, weighing scales, weigh scale, specialty scales, balance scales, diet scales, shipping scales, Tanita scales, ohaus scales, counting scales, baby scales, gram scales, portable scales, body fat scales, crane scales, electronic scales, travel scales, floor scales, kitchen scales, wholesale scales, and triple beam scales."}, {"title": "Best price of weighing scales in Kampala", "description": "Most any type of digital scale you can think of, Eagle Weighing Scales carries. Eagle Weighing Scales can help you find the scale that fits your needs and your budget. If you are tired of the high prices found at other sites for the same product and are looking for an affordable solution. Then you have come to the right place! If you shop around you will see skyrocketing prices from competitors and chances are they get their scales directly from us. It only makes sense to come to the Source. Eagle Weighing Scales is your source for quality, design, function, and friendly timely service with a knowledgeable staff. We are committed to doing business the dignified ethical way and in a way you deserve. The Eagle Weighing Scales. Thank you in advance for allowing Eagle Weighing Scales the privilege of serving you.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Wholesaler of weighing scales in Kampala", "description": "Eagle Weighing Scales Company, Uganda is headquartered in Wandegeya, Kampala, and is a world leader in the sale and supply of precision measurement and product inspection equipment for the health care, laboratory, and other industrial markets.  The Eagle Weighing Scales Medical,  Weighing, and Inspection business units are all renowned for developing reliable, market-proven solutions for the customers they serve.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Electronic Industrial platform scales", "description": "Eagle Weighing Scales Company is a multi-national measurement and control equipment supplier with national headquarters in Kampala, plus operations and distribution centers in Jinja, Entebbe, Mukono, Lira, Gulu, Masaka, Wakiso, Soroti and Mbale\n\nEagle Weighing Scales company firmly believes in providing our customers with innovative superior quality products that are competitively priced. Our qualified sales staff will help you     determine the weighing systems best suited for your growing needs."}, {"title": "Stainless steel electronic weighing scales", "description": "At Eagle Weighing Scales company we provide:Hydraulic, Electronic and Mechanical Truck and Rail Car ScalesHopper, Tank, Bin, Floor, Bench , Lab, Counting, Health and Custom ScalesLoad Cells, Mounts and HardwareInstrumentation and Process ControlsLeasing / Rentals Available\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Digital platform weighing scales in Kampala", "description": "Since 2006, Eagle Weighing Scales company has served the needs for our customers from the pearl of Africa.  With our main office in Wandegeya, we are the largest scale company in the Kampala Uganda and East Africa.\n\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Bench weighing scales in Kampala", "description": "We are proud to offer the widest array of scale equipment available to the weighing industry. Manufacturers such as; Avery, Rice Lake Weighing Systems, Mettler toledo, High Weigh, Seca, Ohaus and Adam Equipment. Sales, service, installation – we do all our own construction to save time and money!"}, {"title": "Platform weighing scales at Eagle Weighing Systems Ltd", "description": "We pride our company registered business on providing superior customer service. We recognize the importance of reliability in your business. That is the very reason our service department is on call 24 hours a day. Our factory-trained technicians can troubleshoot system failures by utilizing the latest technological equipment. Thus, saving your business from costly down time."}, {"title": "Electronic Commercial  weighing scales in Jinja", "description": "Eagle Weighing Scales company would like you to know we guarantee complete customer satisfaction. Simply stated, this means we will always do whatever it takes to fully satisfy every customer, every time.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Price Computing weighing  scales for shops in Uganda", "description": "We do not offer vehicle weighing scales services.  You have to get a certified weight ticket from a public scale.\nEagle Weighing Scales company is a private-owned, URSB and UNBS certified corporation, and has been Supplying and distributing weight-related products and supplies since 2006. Within the company, progressive new technologies merge with the wisdom of industry experience to create the future of weighing through cutting-edge research and design."}, {"title": "Digital Electronic Platform weighing scales", "description": "Eagle Weighing Scales’ roots are planted firmly in the principles of quality and customer service. Through three generations of family ownership, these ideals remain unchanged. Today, Eagle Weighing Scales is a global leader in measurement and automated process control.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Digital Industrial weighing scales", "description": "Eagle Weighing Scales offers more than 40,000 products, with over one million items in stock and available for same- or next-day shipping. The company continues to lead the industry in technological advances and quality products, all with legendary customer service."}, {"title": "platform weighing scales supplier in Entebbe", "description": "Eagle Weighing Scales provides weighing solutions for process and packaging in a variety of industries including food processing, automated manufacturing, chemical, plastics, rubber, and more. We have been offering accurate, quality industrial weighing scales since 2006 and recently celebrated our Centennial year! Eagle Weighing Scales assists processors and manufacturers by offering solutions that create a drastic reduction in waste while enhancing quality and productivity by as much as 50% over other industrial weighing and packaging equipment."}]}, {"name": "Serfilco International Ltd", "address": "United Kingdom", "details": {"Business Type": "Manufacturer", "Industry Type": "Pumps & Pumping", "Market Focus": "Globally (various continents)", "Year Founded": "1961", "Employees": "101-1000", "Turnover": "$10,000,000 US - $100,000,000 US"}, "panels": [{"title": "About Us", "description": "SERFILCO'S Mission StatementSimply stated, our mission is to be a proactive partner with our customers and the industries we serve to meet the challenges imposed by a global economy and increasingly stringent governmental controls regarding safety and waste reduction.\nTo this end, we will continue to develop and manufacture state-of the-art filtration, liquid handling and waste treatment equipment to help achieve the product integrity, quality and cost savings to be competitive in the market place.\nSERFILCOPump Industry Leader Worldwide for Over 45 yearsIt has been said that the success of any business comes from finding a need and fulfilling it. In 1961, our founder, Jack Berg, saw a need in the surface finishing industry for better filtration to improve plating quality and reduce rejects. Armed with only the experience gained as a manufacturer’s representative selling filters to platers and a desire to be in business for himself, he took the plunge and opened a small storefront business selling pumps, filter chambers and filter cartridges.\nFrom that humble beginning, SERFILCO has grown to become a multi-national manufacturer of a wide range of filtration and liquid handling products serving many industries. With five plants in North America as well as operations in England, France and Germany, plus a worldwide network of sales representatives, we are strategically positioned to supply the needs of our customers.\nOver the past four decades, we’ve seen many changes in the field of metal finishing and process industries. As these changes were taking place, equipment was also changing. Newer and better designs, along with a broader array of chemically resistant materials are being used to provide the tools needed to operate more effectively and efficiently, as well as with greater safety for workers and the environment.\nSERFILCO Pumps, Filters, Chambers and Filtration Systems takes pride in its role in bringing many of these advances to the marketplace. Magnetically coupled pumps, vertical pumps, externally mounted single and double mechanical seal pumps, all-plastic filtration systems, and pumped agitation systems using eductors to agitate process and cleaning solutions all can be tracked back to the foresight, ingenuity and perseverance of SERFILCO people.\nFor us, the end of the last millennium was a learning period during which time we accumulated a generation of experience in meeting needs and solving problems with products that are the benchmark of the industry.\nToday, at the start of the new millennium, we are looking forward to the future with the expectation that we will continue to be a technical resource, contributing to the growth and satisfaction of our customers and their needs including our Serfilco Pumps, Filter Chambers, Filtration Systems, Filtration Media, Pump Accessories and Replacement Parts for Pumps."}]}, {"name": "UNTHA Shredding Technology Gmbh", "address": "Austria", "details": {"Business Type": "Manufacturer", "Industry Type": "Recycling Systems", "Market Focus": "Globally (various continents)", "Year Founded": "1970", "Employees": "101-1000"}, "panels": [{"title": "Waste processing", "description": "Our waste shredders are well suited for a 1-step or 2-step waste recycling.\nA mechanical-biological waste shredding is usually performed when processing household or commercial waste similar to household waste. The goal of this treatment is to generate a landfill-suited waste material by separating waste fractions with a high calorific value, valuable resources as well as foreign objects.\nWe understand the tough requirements that the shredding technology of a mechanical-biological waste recycling system faces. With our newly engineered XR series we are able to offer the ideal product that meets these tough requirements for both low operating costs and high availability."}, {"title": "Plastic shredding", "description": "As a renowned manufacturer of reliable plastics shredders, we offer special machines for in-house recycling and for heavily contaminated post-consumer waste.\n\nDue to its format, components and characteristics, plastic is a very versatile material that is primarily used in industrial mass production. The resulting plastic waste can be recycled by shredding and washing the material, before generating a reusable, recycled granulate. Shredded plastic waste can also be used for energy generation."}, {"title": "Metal shredding", "description": "Regardless of whether your metal waste comes from the metal-processing industry, automotive industry, electronics industry, waste industry or commercial production, we will always offer you the right shredding system for recycling your valuable resources!\n\nMetals are important raw materials for the industry and can be repeatedly returned to the recovered resource cycle with very little loss. The recycling of metals saves valuable raw materials and energy as opposed to the new processing of ores.\n\nOur sturdy metal shredders that have been tried and tested a thousand times over, reliably and efficiently shred light metals such as aluminium, magnesium, Al-Mg alloys, copper or nickel, as well as harder metals such as iron, zirconium, titanium and sheet steel."}, {"title": "Refuse Derived Fuels (RDF)", "description": "Our RDF shredding solutions enable you to optimally recycle waste into substitute fuels / alternative fuels and ensure high quality by producing a homogeneous granulate free of foreign objects.\nThe goal of recycling is to use the valuable energy contained in the waste and to substitute the use of fossil fuels. During the recycling process the portions with a high calorific value are separated from the commercial and industrial waste and turned into a marketable product. Depending on the calorific value and the granular size, these fuels are used in fluidised bed combustion, cement plants and substitute fuel power plants.\nThe waste undergoes a single-phase or multi-phase recycling process to separate the fractions with a high calorific value from household waste, bulky waste, industrial waste, commercial waste and sorting residue.\n"}, {"title": "File, data and material destruction", "description": "\nOur shredders reliably protect your sensitive and confidential data from the prying eyes of third parties. We guarantee a secure and uncompromised destruction of your data pursuant to the most recent DIN 66399 standard.\n\nWe offer customized shredding solutions depending on the required protection class, security level and type of data to be processed. Our robust 4-shaft shredders have been tested and proven over several decades and excel where other traditional shredding systems cannot.\n\nThe independent certification centre DEKRA confirmed in an expert report that our 4-shaft shredding machines easily meet the new security standard DIN 66399-2 (destruction systems for files and data carriers)."}, {"title": "Electronic scrap shredding", "description": "Our customized solutions enable you to efficiently shred electronic scrap in your recycling facility and they align perfectly with your recycling system. The granulate size is adjusted such that metals and non-metals can be separated and recycled as best as possible.\nMore than 40 million tons of electrical and electronic scrap are generated annually – and the trend is growing dramatically! Recycling electronic devices is not just beneficial for environmental reasons. This scrap, as a rule, contains many precious metals that are recovered during the recycling process. To ensure a high yield during the recovery process, the shredding should generate only a very low amount of fine particles.\nOur low-speed, industrial shredders are particularly suited for this process. The low speed ensures that circuit boards and old devices are carefully shredded with low emissions. The recycled material is ideally suited for e-scrap recycling machines and subsequently for cutting facilities where precious metals are separated from their impurities."}, {"title": "Wood shredding solutions", "description": "\nOur reliable wood shredders ensure the production of a homogeneous granulate for your in-house wood chip furnace, biogas plant, biomass co-generation plant and also the production of wood briquettes. Regardless of how you are planning to use the wood chips, we will configure the wood shredder exactly according to your needs.\n\nShred wood economically\nWe offer you a large selection of wood shredders with various working widths, rotor diameters and drive capacities. The possible granulate sizes usually range from 12 to 80 mm. Regardless of whether you need a compact, small system or have specific needs, we will always find the right solution for you!\nCapitalize on our reliability! We provide a 3 year carefree warranty on all our UNTHA wood shredders*!\n*) or 2,000 hours, depending on which is reached first."}, {"title": "Company film", "description": "Watch here the company film of UNTHA shredding technology!"}, {"title": "The UNTHA brand", "description": "Welcome to the world of reliable shredding technology!\nSince the company was founded in 1970, UNTHA has been fulfilling its promise to be 'The reliable brand', meaning that we do everything we can to be more reliable than other providers. This applies to all UNTHA products and services. For our customers, this means that choosing an UNTHA system was the best decision they could make."}, {"title": "Our Vision", "description": "When it comes to shredding technology, we are the quality leader in all the markets we serve! We clearly differentiate ourselves from our competitors through the extraordinarily high reliability of our products and services, which enables us to generate economic benefits for our customers. Our shredding solutions also help save valuable raw material resources, promote material reuse and recycling, and and facilitate profitable energy from waste recovery. We are therefore making a valuable contribution to sustainable environmental protection."}, {"title": "Our Mission", "description": "True for more than 40 years, UNTHA is the most reliable brand in shredding technology! This promise will continue long into the future – we do not abandon our customers and we make no compromises with respect to reliability. The usual rule is: Once UNTHA, always UNTHA. Our customers worldwide remain loyal to the UNTHA brand and recommend us to others."}]}, {"name": "Ningbo Fangli Technology Co., Ltd.", "address": "China", "details": {"Business Type": "Manufacturer", "Industry Type": "Pipes and Piping", "Market Focus": "Globally (various continents)", "Year Founded": "1994", "Employees": "101-1000", "Turnover": "$100,000,000 US - $1,000,000,000 US"}, "panels": [{"title": "About Us", "description": "Now it has eight subsidiaries and one provincial-level engineering technological center as below:\nIn addition, the Group has set offices and sales & service centers both in domestic China and overseas like Japan, Singapore, India, Iran, Turkey, Australia, Germany, Russia, Canada, U.S. etc. The main manufacturing aspects the Group covers now are: Extrusion Line for plastic pipe, profile and sheet, Pelletizing Unit, Plastic Auxiliary Machine, Industrial Pump & Valve, Hydraulic Packing Instrument, Welding Equipment etc.The success of Group over the past 14 years not only represents the determination, tireless efforts and dedication of the management team and staff, but also illustrates the company's commitment to continuously create new products to serve the increasingly diverse needs of its customers.Will-power comes from goal & objective and the success requires constant pursuing. Under the modern corporation system, effective stimulation mechanism, scientific management method and the high-quality team, the Group has been keeping its dynamics in the development and innovation. Fangli believes, with its constant efforts, the Group would be a leader in the domestic plastic extrusion machinery industry and a great impact to the international stage."}, {"title": "More about Ningbo Fangli Technology Co., Ltd.", "description": ""}, {"title": "Mission", "description": ""}, {"title": "Philosophy", "description": ""}, {"title": "Spirit", "description": ""}]}, {"name": "Remade Recycling", "address": "South Africa", "details": {"Business Type": "Service provider", "Industry Type": "Waste Management", "Market Focus": "Regionally (various states or provinces)", "Year Founded": "1987", "Employees": "101-1000"}, "panels": [{"title": "About Us", "description": "Remade handles in excess of 20,000 tons of recyclable waste per month which is sold as a subsitute raw-material input source to South Africa's leading manufacturers and is, amongst others, the sole trading partner in the supply of recyclable paper to Sappi's Gauteng Waste Paper division. With solid infrastructures and good relationships with suppliers, our business units are in a position to handle large volumes of recyclable material, including paper, plastic, glass and metal."}]}, {"name": "Genap B.V.", "address": "Netherlands", "details": {"Business Type": "Manufacturer", "Industry Type": "Water Storage", "Market Focus": "Globally (various continents)"}, "panels": [{"title": "About Us", "description": "Genap is the specialist in the field of foil structures and foil applications for the horticultural and agricultural sectors and for civil engineering infrastructure projects. Customised foil structures are produced at our factory in 's-Heerenberg in the Netherlands, where we also have our own laboratory and research & development department.Our SHE (SCC) certified technicians work around the world on a daily basis delivering solutions to defend against, store, cover and retain a range of liquids, solid matter and gasses. The development and production of solutions for the storage of drinking water has recently been added to this because the demand for water storage is increasing worldwide and the possibilities of plastic foils in this area are diverse, sustainable and affordable.From the design of the solution, through to realisation, we undertake everything in house and can therefore guarantee quality to the highest level. It is for good reason that during the last 60 years Genap has grown to become Europe’s leading company when it comes to processing and application of geosynthetics."}, {"title": "Our Mission", "description": "“To create waterproof solutions for all of our clients”\nGenap focuses on using plastic foils in total concepts for the storage and separation of liquids, in particular water. Through continuous innovation and collaboration with parties that contribute additional expertise, Genap is able to provide its clients with high-quality solutions for the horticultural and agricultural sectors and for civil engineering infrastructure projects. The development of foil solutions for drinking water has been recently added and this forms a significant mainstay for the future.\nThroughout the world we are seeing an increasing demand for water storage. In addition to our home market in the Netherlands we also focus on exporting our solutions. From our site in Kenya we serve the African market with solutions that we produce locally. In addition, we are constantly seeking new ‘resellers’ in order to strengthen and to expand our international distribution network.\nGenap is unique in that it is able to utilise its own R&D, production and installation facilities. The driving force behind our solutions is our 60 staff who focus daily on creating sustainable, waterproof solutions – with passion and expertise. In addition, we are always aware of the effects that our operational processes can have on the environment and we aim to address these in a responsible manner. For us, Corporate Social Responsibility therefore means making integral sustainable choices. All of this has brought Genap to where it is today and we wish to share it and help contribute towards the success of our clients."}, {"title": "Genap & Quality", "description": "On the basis of our mission: “To create waterproof solutions for all of our clients” our foil structure solutions have to be watertight and able to last up to 100 years. To achieve this, quality is an important core value within our organisation and is therefore embedded in all of our departments and business processes.Genap is ISO-certified (9001:2008). The procedures for the various business processes are therefore recorded organisation-wide and are subjected to annual internal and external audits. In addition, we hold the VCA* process certificate; this certificate guarantees safety and a responsible approach to production and assembly of products of plastic foil, or the application of it in the projects.The quality of a foil structure is determined by the material and the method of processing. The authorities have drawn up various certificates or assessment guidelines (BRLs) for these, which contain the minimum requirements that a product or process must meet. For the processing of plastic foil we hold BRL 1149/K537. We also process materials that have a specific product certificate and foil materials that are certified according to DIBt or BAM.To be able to check the quality of our foil materials and welded seams we have our own laboratory with an air-conditioned room for, amongst other things, tensile and peeling tests, where the tests are conducted in accordance with the prescribed standards. The certificates and the associated assessment guideline are prepared by Kiwa and are evaluated/audited annually."}, {"title": "Working at Genap", "description": "Genap is a multifaceted company whose core activity is the processing of plastic foil structures. Genap offers opportunities for the most wide-ranging of people from different backgrounds, education and careers. This is in part because we control the total chain from design and production of our solutions, through to installation.\nWorking at Genap means you will be challenged - on the one hand to familiarise yourself with a large variety of products and international markets and, on the other hand, to help meet the growing demand for our solutions that are exported worldwide. At Genap we have three important fundamentals that we can summarize in a single sentence: we want to work in an innovativeenvironment, whereby the client and the quality are central. Would you also like to be part of our inspiring firm?"}, {"title": "Sustainability", "description": "Thinking sustainable – acting sustainable\nAn increasing scarcity of raw materials and the enormous negative impact on the environment by man is a growing worldwide problem. Genap is therefore fully aware of its responsibility and does not intend to stay on the sidelines when it comes to sustainability. This translates into the choices we make with regard to energy management, buying in products with an environmental quality label, the use of energy-efficient vehicles and targets for our CO2 footprint.\nWe are fully aware of the impact that our business processes have on our environment and we aim to manage this in a responsible manner. For us, our Corporate Social Responsibility therefore means: making integrated sustainable choices."}, {"title": "Green Farming", "description": "Green Farming\nGenap is also pleased to provide its expertise and product innovation in the field of international (development) collaboration. An example of this is Green Farming: a programme for Dutch horticultural suppliers who are active in exporting goods, services, knowledge and advice to the Ethiopian and Kenyan market.\nThe programme is intended to promote the export of Dutch products through concerted action in the Ethiopian and Kenyan market. In addition, the programme also focuses on intensifying collaboration between the Dutch members and Ethiopian and Kenyan businesses and organisations in the field of research, development and production.\nGreen Farming is coordinated by sector organisation AVAG and DLV Plant and is supported by the Ministry for International Trade and Development Collaboration. Wageningen UR (the university and research centre based in Wageningen, Netherlands) further strengthens the cluster in the field of research. Within the framework of this collaboration, Genap has developed and installed fully enclosed water reservoirs and silos at the Van den Berg Roses demonstration project in Naivasha, Kenya."}]}, {"name": "Clack Corporation", "address": "Wisconsin", "details": {"Business Type": "Manufacturer", "Industry Type": "Water Treatment", "Market Focus": "Globally (various continents)"}, "panels": [{"title": "About Us", "description": "In 1946 Bill Clack and his father Willis Clack opened a small water softener exchange business in Madison, Wisconsin. Clack Soft Water eventually grew into a small Wisconsin dealer network featuring the Golden Seahorse brand.By 1960, Clack Soft Water had evolved into a manufacturing and distributing company serving independent OEM assemblers. During the 1960s, Clack designed and manufactured several brass control valves including the 609, which was a five-cycle, fully automatic valve, the only plastic part being the injector. Clack also improved corrosion resistance of raw steel tanks by using epoxy liners and over-painting enamel for use in manufacturing side mount filter and softener tanks.  Clack Corporation’s primary activity was distributing Ionac C249 resin, Erie control valves, Apex fiberglass mineral tanks, as well as manufacturing various components such as 369 Manumatic valves, brine valves, and iron removal medias such as BIRM®.From 1969 through the mid 1970’s, Clack participated in a joint venture in Belgium with Erie Controls, with Clack responsible for manufacturing Apex-style mineral tanks. Because of the 1974 oil crisis, Clack began manufacturing blow molded brine tanks by 1975. Clack Corporation later formed a joint venture in Belgium with Structural Fibers, distributing Clack products as well as manufacturing Structural FRP tanks.Richard Clack joined the company on a full time basis in 1970, after graduating from the University of Wisconsin. Rich was responsible for the growth of the blow molding components division during the late 1970s, creating a complete line of brine tanks and specialized custom blow molding that included three production facilities. The complete line of manufactured brine tanks allowed Clack to consolidate components to OEMs in a very competitive package, reducing customer inventory and increasing their product turns.In the early 1980s, Clack started molding proprietary plastic water treatment components and assembling filter cartridges in Rogers, Arkansas. The 1980s included the learning curve conversions from brass parts to engineered plastics. Clack introduced the Microline RO system using a patented proprietary designed manifold plate that took advantage of previous plastic molding experiences.Rich became president and CEO of Clack on the passing of his father Bill in 1987. In the 1990s, Clack continued to grow plastic custom blow molding as well as greatly improving the distribution of water treatment components to customers worldwide. Because of industry consolidation and market conditions, Clack designed and introduced a completely new electronic 1 inch engineered plastic control valve in 2000, taking advantage of multiple customer focus groups and utilizing its past plastic molding knowledge of water treatment pressurized components. In the following nine years, Clack completed its line of residential and commercial control valves up to 3 inch service flow. Today Clack is one of a few family businesses that still claim that their manufactured products are “Made in USA”."}, {"title": "Our Mission and Vision", "description": "The mission of the Clack Corporation is to be a solid progressive force  in the water treatment field and a leader in plastic processing by  developing strong customer and vendor relationships through the highest  quality products at a competitive price with a clean, safe work  environment where employees are rewarded for their productive  accomplishments."}]}, {"name": "Exhibition Management Services", "address": "South Africa", "details": {"Business Type": "Event organizer", "Industry Type": "Plastics & Resins", "Market Focus": "Internationally (various countries)"}, "panels": []}, {"name": "Eagle Weighing Systems Ltd", "address": "Uganda", "details": {"Business Type": "Distributor", "Industry Type": "Laboratory Equipment", "Market Focus": "Internationally (various countries)", "Year Founded": "2006", "Employees": "11-100", "Turnover": "$10,000,000 US - $100,000,000 US"}, "panels": [{"title": "Digital Truck Weighing Scale/Truck Scale/Industrial Floor Scale at Eagle Weighing Scales kampala, Ug", "description": "“ We don't just sell scales, we solve problems”\nIncepted in the year 2006, we Eagle Weighing Systems Ltd are recognized as one of the foremost , Suppliers, Traders and Wholesalers of impeccable rangeofweighing scales such as; Whole sale scales, Baby scales, Mini palm scales, Industrial platforms, assorted weighing brands including Avery, Salter, Health ( height and weight ) scales, Precision scales Analytical/Laboratory scales, Moisture meters, Temperature gauges, Pallet trolleys, kitchen scales, Animal scales, Bag closers-stitching machine, Plastic bag sealers, Plastic foot sealers, Batch sealers, Table top scales, Counter scales, Barcode readers/printer, Waterproof scales, Axle weigh bridge, Mini and full Weigh bridges among others. These products are developed by skillful professionals utilizing quality approved material which we have sourced from certified vendors of the market. Under these categories we offer Table Top Scales – Digital, Price Computing Scales Digital, Pocket Precision Scales, Personal Weighing Scales Digital, Beam Scales Mechanical, Counter Scales Mechanical, Liquid Measures, Pedestal – Mechanical, Regular Platform Scale Load Cell and Crane Weighing Scales Digital. Our offered range is designed in adherence set with industry norms & standards with the help of cutting-edge technology. Excellent quality control has been established by us to make sure that our assortment is free from fault .\nWe are located at Wandegeya\nFor more details please contact us on ; +256 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com\neagleweighingsystems.blogspot.com\nhttps://plus.google.com/u/0/104815763787026905059\nhttps://twitter.com/EagleWeighing\nhttps://facebook.com/eagle.weighingsystems\nhttps://eagleweighingsystems.wordpress.com/contact/\nhttps://www.linkedin.com/in/eagle-weighingsystems\nhttps://www.instagram.com/eagleweighingsystems/\nhttps://eagleweighingsystems.blogspot.com/\nhttps://www.google.com/maps/place/Eagle+Weighing+Systems/\nhttps://eagle-weighing-systems-ltd.business.site/\nhttps://eagle-weighing-scales-kampalauganda.business.site\n\n\n\n"}, {"title": "Digital weight 3 ton electric warehouse weighing scales", "description": "We provide innovative solutions and professional services ranging from simple weight scale applications and preventative maintenance contracts to complex automation and engineering design.\nWe have over 10 years of combined experience in industrial weighing, specializing in electronic and mechanical weighing systems. We offer sales and service of all major national brands.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "A12E platform weighing scales in Kampala", "description": "We have access to all different types of digital scales. Eagle Weighing Scales can supply a digital scale to fit any weighing application, including custom applications of any kind. We also will match any competitors price for any digital scale we carry.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Heavy duty weighing scales in Kampala", "description": "Eagle Weighing Scales Company presents and delivers state of the art scales as well as traditional scales at the most affordable prices. We understand your needs as a customer and client. We also understand your budget. We do our level best to exceed your expectations in quality, service, design and function. After all It is The Eagle Weighing Scales (Way). These are just some of the many types of scales we carry: digital scales, mini palm sized scales, pocket scales, bathroom scales, weighing scales, weigh scale, specialty scales, balance scales, diet scales, shipping scales, Tanita scales, ohaus scales, counting scales, baby scales, gram scales, portable scales, body fat scales, crane scales, electronic scales, travel scales, floor scales, kitchen scales, wholesale scales, and triple beam scales. Most any type of digital scale you can think of, Eagle Weighing Scales carries.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "weight floor weighing scales for industries", "description": "Eagle Weighing Scales can help you find the scale that fits your needs and your budget. If you are tired of the high prices found at other sites for the same product and are looking for an affordable solution. Then you have come to the right place! If you shop around you will see skyrocketing prices from competitors and chances are they get their scales directly from us. It only makes sense to come to the Source. Eagle Weighing Scales is your source for quality, design, function, and friendly timely service with a knowledgeable staff. We are committed to doing business the dignified ethical way and in a way you deserve. The Eagle Weighing Scales. Thank you in advance for allowing Eagle Weighing Scales the privilege of serving you.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Electronic Digital Industrial Platforms Kampala", "description": "Eagle Weighing Scales Company, Uganda is headquartered in Wandegeya, Kampala, and is a world leader in the sale and supply of precision measurement and product inspection equipment for the health care, laboratory, and other industrial markets.  The Eagle Weighing Scales Medical,  Weighing, and Inspection business units are all renowned for developing reliable, market-proven solutions for the customers they serve.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Weighing Scale Bench Scale For Sale in Kampala", "description": "Eagle Weighing Scales Company is a multi-national measurement and control equipment supplier with national headquarters in Kampala, plus operations and distribution centers in Jinja, Entebbe, Mukono, Lira, Gulu, Masaka, Wakiso, Soroti and Mbale\nEagle Weighing Scales company firmly believes in providing our customers with innovative superior quality products that are competitively priced. Our qualified sales staff will help you     determine the weighing systems best suited for your growing needs.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Electronic Weighing Scales", "description": "At Eagle Weighing Scales company we provide:Hydraulic, Electronic and Mechanical Truck and Rail Car ScalesHopper, Tank, Bin, Floor, Bench , Lab, Counting, Health and Custom ScalesLoad Cells, Mounts and HardwareInstrumentation and Process ControlsLeasing / Rentals Available\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Electronic Price computing platform scales", "description": "Since 2006, Eagle Weighing Scales company has served the needs for our customers from the pearl of Africa.  With our main office in Wandegeya, we are the largest scale company in the Kampala Uganda and East Africa. Opening a new location in\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "300kg Digital Platform weighing scale", "description": "We are proud to offer the widest array of scale equipment available to the weighing industry. Manufacturers such as; Avery, Rice Lake Weighing Systems, Mettler toledo, High Weigh, Seca, Ohaus and Adam Equipment. Sales, service, installation – we do all our own construction to save time and money!\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "1000 kg digital weight scales and machines", "description": "We pride our company registered business on providing superior customer service. We recognize the importance of reliability in your business. That is the very reason our service department is on call 24 hours a day. Our factory-trained technicians can troubleshoot system failures by utilizing the latest technological equipment. Thus, saving your business from costly down time\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "platform floor scale industrial weighing scales", "description": "Eagle Weighing Scales company would like you to know we guarantee complete customer satisfaction. Simply stated, this means we will always do whatever it takes to fully satisfy every customer, every time.We do not offer vehicle weighing scales services.  You have to get a certified weight ticket from a public scale.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "platform floor scale industrial weighing scales", "description": "Eagle Weighing Scales company would like you to know we guarantee complete customer satisfaction. Simply stated, this means we will always do whatever it takes to fully satisfy every customer, every time.We do not offer vehicle weighing scales services.  You have to get a certified weight ticket from a public scale.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "electronic platform digital weighing scale with railing", "description": "Eagle Weighing Scales company is a private-owned, URSB and UNBS certified corporation, and has been Supplying and distributing weight-related products and supplies since 2006. Within the company, progressive new technologies merge with the wisdom of industry experience to create the future of weighing through cutting-edge research and design.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Digital Platform scale 40kg electronic weigh scale", "description": "Eagle Weighing Scales’ roots are planted firmly in the principles of quality and customer service. Through three generations of family ownership, these ideals remain unchanged. Today, Eagle Weighing Scales is a global leader in measurement and automated process control.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Electronic floor weighing scale bench scales", "description": "Eagle Weighing Scales offers more than 40,000 products, with over one million items in stock and available for same- or next-day shipping. The company continues to lead the industry in technological advances and quality products, all with legendary customer service."}, {"title": "Eagle scales 300 Kg platforms in Kampala", "description": "Eagle Weighing Scales provides weighing solutions for process and packaging in a variety of industries including food processing, automated manufacturing, chemical, plastics, rubber, and more. We have been offering accurate, quality industrial weighing scales since 2006 and recently celebrated our Centennial year! Eagle Weighing Scales assists processors and manufacturers by offering solutions that create a drastic reduction in waste while enhancing quality and productivity by as much as 50% over other industrial weighing and packaging equipment.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Eagle scales 300 Kg platforms in Kampala", "description": "Eagle Weighing Scales provides weighing solutions for process and packaging in a variety of industries including food processing, automated manufacturing, chemical, plastics, rubber, and more. We have been offering accurate, quality industrial weighing scales since 2006 and recently celebrated our Centennial year! Eagle Weighing Scales assists processors and manufacturers by offering solutions that create a drastic reduction in waste while enhancing quality and productivity by as much as 50% over other industrial weighing and packaging equipment.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Eagle scales 300 Kg platforms in Kampala", "description": "Eagle Weighing Scales provides weighing solutions for process and packaging in a variety of industries including food processing, automated manufacturing, chemical, plastics, rubber, and more. We have been offering accurate, quality industrial weighing scales since 2006 and recently celebrated our Centennial year! Eagle Weighing Scales assists processors and manufacturers by offering solutions that create a drastic reduction in waste while enhancing quality and productivity by as much as 50% over other industrial weighing and packaging equipment.\nFor any further inquiries, mail or contact us\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\nOr email us at;eagleweighingsystems@gmail.com"}]}, {"name": "Weighing Scales Company In Uganda", "address": "Uganda", "details": {"Business Type": "Manufacturer", "Industry Type": "Agriculture", "Market Focus": "Globally (various continents)", "Year Founded": "2008", "Employees": "101-1000", "Turnover": "$10,000,000 US - $100,000,000 US"}, "panels": [{"title": "What is the price of a weighing scale in Kampala ?", "description": "Eagle Weighing Scales provides weighing solutions for process and packaging in a variety of industries including food processing, automated manufacturing, chemical, plastics, rubber, and more. We have been offering accurate, quality industrial weighing scales since 2006 and recently celebrated our Centennial year! Eagle Weighing Scales assists processors and manufacturers by offering solutions that create a drastic reduction in waste while enhancing quality and productivity by as much as 50% over other industrial weighing and packaging equipment.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Do you need a weighing scale ?", "description": "We provide innovative solutions and professional services ranging from simple weight scale applications and preventative maintenance contracts to complex automation and engineering design.\nWe have over 10 years of combined experience in industrial weighing, specializing in electronic and mechanical weighing systems. We offer sales and service of all major national brands.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Weighing scales shop in Uganda", "description": "We have access to all different types of digital scales. Eagle Weighing Scales can supply a digital scale to fit any weighing application, including custom applications of any kind. We also will match any competitors price for any digital scale we carry.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Where to buy digital weighing scales in Kampala", "description": "Eagle Weighing Scales Company presents and delivers state of the art scales as well as traditional scales at the most affordable prices. We understand your needs as a customer and client. We also understand your budget. We do our level best to exceed your expectations in quality, service, design and function. After all It is The Eagle Weighing Scales (Way). These are just some of the many types of scales we carry: digital scales, mini palm sized scales, pocket scales, bathroom scales, weighing scales, weigh scale, specialty scales, balance scales, diet scales, shipping scales, Tanita scales, ohaus scales, counting scales, baby scales, gram scales, portable scales, body fat scales, crane scales, electronic scales, travel scales, floor scales, kitchen scales, wholesale scales, and triple beam scales."}, {"title": "Best price of weighing scales in Kampala", "description": "Most any type of digital scale you can think of, Eagle Weighing Scales carries. Eagle Weighing Scales can help you find the scale that fits your needs and your budget. If you are tired of the high prices found at other sites for the same product and are looking for an affordable solution. Then you have come to the right place! If you shop around you will see skyrocketing prices from competitors and chances are they get their scales directly from us. It only makes sense to come to the Source. Eagle Weighing Scales is your source for quality, design, function, and friendly timely service with a knowledgeable staff. We are committed to doing business the dignified ethical way and in a way you deserve. The Eagle Weighing Scales. Thank you in advance for allowing Eagle Weighing Scales the privilege of serving you.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Wholesaler of weighing scales in Kampala", "description": "Eagle Weighing Scales Company, Uganda is headquartered in Wandegeya, Kampala, and is a world leader in the sale and supply of precision measurement and product inspection equipment for the health care, laboratory, and other industrial markets.  The Eagle Weighing Scales Medical,  Weighing, and Inspection business units are all renowned for developing reliable, market-proven solutions for the customers they serve.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Electronic Industrial platform scales", "description": "Eagle Weighing Scales Company is a multi-national measurement and control equipment supplier with national headquarters in Kampala, plus operations and distribution centers in Jinja, Entebbe, Mukono, Lira, Gulu, Masaka, Wakiso, Soroti and Mbale\n\nEagle Weighing Scales company firmly believes in providing our customers with innovative superior quality products that are competitively priced. Our qualified sales staff will help you     determine the weighing systems best suited for your growing needs."}, {"title": "Stainless steel electronic weighing scales", "description": "At Eagle Weighing Scales company we provide:Hydraulic, Electronic and Mechanical Truck and Rail Car ScalesHopper, Tank, Bin, Floor, Bench , Lab, Counting, Health and Custom ScalesLoad Cells, Mounts and HardwareInstrumentation and Process ControlsLeasing / Rentals Available\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Digital platform weighing scales in Kampala", "description": "Since 2006, Eagle Weighing Scales company has served the needs for our customers from the pearl of Africa.  With our main office in Wandegeya, we are the largest scale company in the Kampala Uganda and East Africa.\n\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Bench weighing scales in Kampala", "description": "We are proud to offer the widest array of scale equipment available to the weighing industry. Manufacturers such as; Avery, Rice Lake Weighing Systems, Mettler toledo, High Weigh, Seca, Ohaus and Adam Equipment. Sales, service, installation – we do all our own construction to save time and money!"}, {"title": "Platform weighing scales at Eagle Weighing Systems Ltd", "description": "We pride our company registered business on providing superior customer service. We recognize the importance of reliability in your business. That is the very reason our service department is on call 24 hours a day. Our factory-trained technicians can troubleshoot system failures by utilizing the latest technological equipment. Thus, saving your business from costly down time."}, {"title": "Electronic Commercial  weighing scales in Jinja", "description": "Eagle Weighing Scales company would like you to know we guarantee complete customer satisfaction. Simply stated, this means we will always do whatever it takes to fully satisfy every customer, every time.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Price Computing weighing  scales for shops in Uganda", "description": "We do not offer vehicle weighing scales services.  You have to get a certified weight ticket from a public scale.\nEagle Weighing Scales company is a private-owned, URSB and UNBS certified corporation, and has been Supplying and distributing weight-related products and supplies since 2006. Within the company, progressive new technologies merge with the wisdom of industry experience to create the future of weighing through cutting-edge research and design."}, {"title": "Digital Electronic Platform weighing scales", "description": "Eagle Weighing Scales’ roots are planted firmly in the principles of quality and customer service. Through three generations of family ownership, these ideals remain unchanged. Today, Eagle Weighing Scales is a global leader in measurement and automated process control.\nAddress: Wandegeya University Plaza Room A18\nFor orders and deliveries please contact us on : +256 (0) 700225423\n+256 (0) 787089315\n\nOr email us at;eagleweighingsystems@gmail.com"}, {"title": "Digital Industrial weighing scales", "description": "Eagle Weighing Scales offers more than 40,000 products, with over one million items in stock and available for same- or next-day shipping. The company continues to lead the industry in technological advances and quality products, all with legendary customer service."}, {"title": "platform weighing scales supplier in Entebbe", "description": "Eagle Weighing Scales provides weighing solutions for process and packaging in a variety of industries including food processing, automated manufacturing, chemical, plastics, rubber, and more. We have been offering accurate, quality industrial weighing scales since 2006 and recently celebrated our Centennial year! Eagle Weighing Scales assists processors and manufacturers by offering solutions that create a drastic reduction in waste while enhancing quality and productivity by as much as 50% over other industrial weighing and packaging equipment."}]}, {"name": "Serfilco International Ltd", "address": "United Kingdom", "details": {"Business Type": "Manufacturer", "Industry Type": "Pumps & Pumping", "Market Focus": "Globally (various continents)", "Year Founded": "1961", "Employees": "101-1000", "Turnover": "$10,000,000 US - $100,000,000 US"}, "panels": [{"title": "About Us", "description": "SERFILCO'S Mission StatementSimply stated, our mission is to be a proactive partner with our customers and the industries we serve to meet the challenges imposed by a global economy and increasingly stringent governmental controls regarding safety and waste reduction.\nTo this end, we will continue to develop and manufacture state-of the-art filtration, liquid handling and waste treatment equipment to help achieve the product integrity, quality and cost savings to be competitive in the market place.\nSERFILCOPump Industry Leader Worldwide for Over 45 yearsIt has been said that the success of any business comes from finding a need and fulfilling it. In 1961, our founder, Jack Berg, saw a need in the surface finishing industry for better filtration to improve plating quality and reduce rejects. Armed with only the experience gained as a manufacturer’s representative selling filters to platers and a desire to be in business for himself, he took the plunge and opened a small storefront business selling pumps, filter chambers and filter cartridges.\nFrom that humble beginning, SERFILCO has grown to become a multi-national manufacturer of a wide range of filtration and liquid handling products serving many industries. With five plants in North America as well as operations in England, France and Germany, plus a worldwide network of sales representatives, we are strategically positioned to supply the needs of our customers.\nOver the past four decades, we’ve seen many changes in the field of metal finishing and process industries. As these changes were taking place, equipment was also changing. Newer and better designs, along with a broader array of chemically resistant materials are being used to provide the tools needed to operate more effectively and efficiently, as well as with greater safety for workers and the environment.\nSERFILCO Pumps, Filters, Chambers and Filtration Systems takes pride in its role in bringing many of these advances to the marketplace. Magnetically coupled pumps, vertical pumps, externally mounted single and double mechanical seal pumps, all-plastic filtration systems, and pumped agitation systems using eductors to agitate process and cleaning solutions all can be tracked back to the foresight, ingenuity and perseverance of SERFILCO people.\nFor us, the end of the last millennium was a learning period during which time we accumulated a generation of experience in meeting needs and solving problems with products that are the benchmark of the industry.\nToday, at the start of the new millennium, we are looking forward to the future with the expectation that we will continue to be a technical resource, contributing to the growth and satisfaction of our customers and their needs including our Serfilco Pumps, Filter Chambers, Filtration Systems, Filtration Media, Pump Accessories and Replacement Parts for Pumps."}]}]